{
    "events": [ ],
    "rules": [
        {
            "name": "User Goal",
            "description": "Defines whether the user has a goal",
            "conditions": [ "business OR leisure OR studying" ],
            "events": [ "userHasGoal = 1" ]
        },
        {
            "name": "User Budget",
            "description": "Defines whether the user has stated the budget",
            "conditions": [ "expensive OR average OR cheap" ],
            "events": [ "userStatedBudget = 1" ]
        },
        {
            "name": "Hotel Service",
            "description": "Defines whether the user has chosen a hotel service",
            "conditions": [ "service_long_stay OR service_breakfast OR service_bar OR service_meeting_room" ],
            "events": [ "userChoseHotelService = 1" ]
        },
        {
            "name": "User Social Goal",
            "description": "Defines the social preferences of the user",
            "conditions": [ "family OR romantic OR cultural OR bar OR private OR gang" ],
            "events": [ "userHasSocialGoal = 1" ]
        }
    ],
    "endpoints": [
        {
            "name": "Prinsenhof Hotel",
            "description": "Angel recommends you this 4-star boutique hotel in the heart of Groningen. Right in the shadows of the Martini Tower, its beautiful garden will offer the best cultural experience, suitable for any purpose. ",
            "image": "assets/images/prinsenhofHotel.jpg",
            "conditions": [ "hotel AND ((business AND (service_meeting_room OR service_bar) AND cultural) OR (leisure AND (cultural OR romantic) AND service_bar)) AND NOT cheap AND NOT (cultural AND average) AND NOT (expensive AND romantic) AND area_citycenter" ]
        },
        {
            "name": "City Hotel",
            "description": "This is a great place for you if you want to stay in the city center at the best price.",
            "image": "assets/images/cityHotel.jpg",
            "conditions": [ "hotel AND leisure AND average AND service_breakfast AND romantic AND area_citycenter" ]
        },
        {
            "name": "NH Hotel de Ville",
            "description": "According to your requirements, Angel suggests you to opt for the NH Hotel de Ville. ",
            "image": "assets/images/nhDeVille.jpg",
            "conditions": [ "hotel AND ((business AND (service_breakfast OR service_meeting_room) AND cultural) OR (leisure AND (family OR romantic OR cultural) AND service_breakfast)) AND (average OR expensive) AND area_citycenter" ]
        },
        {
            "name": "Klipper Zwadde Boat Hotel",
            "description": " Staying in a boat hotel! I bet you've never thought about that, huh? Angel highly suggests this for a unique experience ;) ",
            "image": "assets/images/KlipperZwaddeboatHotel.jpg",
            "conditions": [ "hotel AND leisure AND cultural AND average AND NOT (service_breakfast OR service_bar OR service_long_stay OR service_conference_room) " ]
        },
        {
            "name": "Martini Hotel Groningen",
            "description": "Wonderful memories are granted if you stay here, the sweet spot of Groningen. ",
            "image": "assets/images/martini.jpg",
            "conditions": [ "hotel AND ((business AND cultural) OR (leisure AND (family OR romantic OR cultural)) AND service_bar) AND (cheap OR average) AND area_citycenter" ]
        },
        {
            "name": "Hotel Miss Blanche",
            "description": "The best option for you, my friend, would be this boutique hotel in the city of Groningen with luxurious and uniquely furnished rooms. ",
            "image": "assets/images/missBlanche.jpg",
            "conditions": [ "hotel AND ((business AND service_meeting_room) OR (leisure AND (romantic OR family) AND service_bar)) AND area_citycenter AND expensive" ]
        },
        {
            "name": "The Student Hotel",
            "image": "assets/images/studentHotel.jpg",
            "description": "This is the best option for you, with everything you need + the chance of extending your stay for up to a couple of months at a good price. ",
            "conditions": [ "hotel AND (business OR leisure) AND service_long_stay " ]
        },
        {
            "name": "Stee in stad",
            "description": " This is a great place for staying in with your family, a perfect location since you're close to the city center and the area is quiet and nice, all at the best price.",
            "image": "assets/images/steeInStad.jpg",
            "conditions": [ "hotel AND leisure AND family AND average AND service_breakfast AND area_korrewegwijk " ]
        },        
        {
            "name": "Mercure",
            "description": "This hotel has all the facilities you could probably wish for, all in an isolated environment, reasonably far away from the city center crowdedness.  ",
            "image": "assets/images/mercure.jpg",
            "conditions": [ "hotel AND ((business AND (service_breakfast OR service_bar) AND cultural) OR (leisure AND (service_breakfast OR service_bar) AND (family OR cultural OR romantic))) AND (average OR cheap) AND area_rivierenbuurt " ]
        },
        {
            "name": "Apollo Hotel",
            "description": "This hotel has all the facilities you could probably wish for, be it renting a bike, a fitness center or business meeting rooms. All in an isolated environment, reasonably far away from the city center crowdedness.  ",
            "image": "assets/images/apolloHotel.jpg",
            "conditions": ["hotel AND ((business AND (service_meeting_room OR service_bar OR service_breakfast) AND cultural) OR (leisure AND (service_bar OR service_breakfast) AND (family OR romantic OR cultural))) AND expensive AND area_rivierenbuurt " ]
        },
        {
            "name": "Bed & Breakfast 'Het Kasteeltje'",
            "description": "I know you're on a budget, but trust me, this place will make your family feel like you've had the best vacation ever! Cosy rooms, your own kitchen and a friendly neighbourhood, what else is there to wish for?. ",
            "image": "assets/images/theManor.jpg",
            "conditions": [ "hotel AND leisure AND  (family AND cheap)" ]
        },
        {
            "name":"Boutique Hotel De Doelen",
            "description": "A beautiful place with the touch of a museum. ",
            "image": "assets/images/deDoelen.jpg",
            "conditions": [ "hotel AND leisure AND (area_citycenter AND ( romantic OR cultural) AND service_breakfast) AND cheap" ]
        },
        {
            "name": "Mr Mofongo",
            "image": "assets/images/mrmofongo.png",
            "description": "Mr. Mofongo has seven different 'worlds', each with its own atmosphere and culinary experience. In addition to quality, every world guarantees innovation, sustainability and above all experience. Let yourself be carried away by Máximo's endless wanderlust and join him on an adventure! ",
            "conditions": [
                "restaurant   AND (business OR leisure) AND (romantic OR bar OR gang OR private) AND (average OR expensive) AND (region_asian )  AND NOT (romantic AND region_asian AND expensive AND lang_japanese)"
            ]
        },
        {
            "name": "De Drie Gezusters",
            "image": "assets/images/de3gezusters.jpg",
            "description": "One of Groningen's pearls, the perfect place to be absorbed into the mazes of the Dutch architecture, dating back to centuries ago. Aside from friedly staff, you'll be presented the chance to have a view towards Grote Markt",
             "conditions": [
                "restaurant   AND  (leisure OR business) AND (cultural) AND (lang_dutch) AND average"
            ]
        },
        {
            "name": "De Drie Gezusters",
            "image": "assets/images/de3gezusters.jpg",
            "description": "One of Groningen's pearls, the perfect place to be absorbed into the mazes of the Dutch architecture, dating back to centuries ago. Aside from friedly staff, you'll be presented the chance to have a view towards Grote Markt",
            "conditions": [ "restaurant   AND  (leisure OR business) AND (cultural) AND (lang_dutch) AND average  AND (dinner OR lunch)" ]
        },
        {
            "name": "Mr Smith's",
            "image": "assets/images/mrsmith.jpg",
            "description": "Welcome to the jungle! Tropical cocktails just for you! ",
             "conditions": [
                "restaurant   AND  leisure AND (romantic OR bar) AND (lang_thai OR lang_dutch) AND average"
            ]
        },
        {
            "name": "Bronco",
            "image": "assets/images/bronco.jpg",
            "description": "The best RibHouse in Groningen",
            "conditions": [
                "restaurant   AND (leisure OR business) AND (average OR expensive) AND (gang OR bar) AND lang_us"
            ]
        },
        {
            "name": "De Betere Tijden",
            "image": "assets/images/debeteretijden.jpg",
            "description": " They are renowned for their surprise menu, consisting of 3, 4 or 5 courses. Of course, your preferences are taken into account.",
             "conditions": [
                "restaurant   AND (business OR leisure) AND (romantic OR private OR family) AND average AND lang_dutch "
            ]
        },
        {
            "name": "Chang Thai Bistro",
            "image": "assets/images/changThaiBistro.jpg",
            "description": " This place is specialized in authentic Thai dishes.  ",
             "conditions": [
                "restaurant AND ( leisure OR business) AND (cultural OR family) AND expensive AND (lang_thai) "
            ]
        },
        {
            "name": "De Kleine Heerlijkheid",
            "image": "assets/images/deKleineHeerlijkheid.jpg",
            "description": "Elbrich & Zaneta are friends and now also business partners. They came up with the idea of ​​creating a place where people feel at home and are pampered and very tasty food. The restaurant can rightly be called a living room restaurant. ",
           "conditions": [
                "restaurant   AND (business OR leisure) AND (romantic OR private) AND average AND lang_dutch "
            ]
        },
        {
            "name": "Cho Fah",
            "image": "assets/images/chofah.jpg",
            "description": "Very good and authentic Thai food. Nice restaurant and friendly service. ",
             "conditions": [
                "restaurant   AND (business OR leisure) AND average  AND lang_thai AND (cultural OR family) "
            ]
        },
        {
            "name": "Gustatio",
            "image": "assets/images/gustatio.jpg",
            "description": "Angel's Favorite! The owners of this casual osteria wants to bring traditional Italian cuisine to the fore. No complicated combinations here, but homemade pasta and powerful flavors that will take your taste buds on a journey. Delicious authentic cuisine.",
            "conditions": [
                "restaurant   AND leisure AND (romantic OR family) AND average AND lang_italian "
            ]
        },
        {
            "name": "Da Vinci",
            "image": "assets/images/davinci.jpg",
            "description": "Homemade Italian food, by the water.",
            "conditions": [
                "restaurant   AND (business OR leisure) AND (romantic OR cultural) AND average AND lang_italian "
            ]
        },
        {
            "name": "Ouzerie De Olijfboom",
            "image": "assets/images/deOlijfboom.jpg",
            "description": "Taste traditional food from the best Greek restaurant in Groningen!",
            "conditions": [
                "restaurant   AND (business OR leisure) AND (gang OR family) AND (average OR cheap)  AND lang_greek "
            ]
        },
        {
            "name": "Thai Jasmine",
            "image": "assets/images/thaijasmine.jpg",
            "description": "The BEST Thai food Angel ever had! ",
            "conditions": [
                "restaurant   AND (business OR leisure) AND (cheap OR average) AND gang AND lang_thai "
            ]
        },
        {
            "name": "Imono",
            "image": "assets/images/imono.jpg",
            "description": "Perfect for a first sushi date!",
            "conditions": [
                "restaurant   AND leisure AND (romantic OR private OR cultural) AND (average OR expensive) AND lang_japanese  "
            ]
        },
        {
            "name": "Hanasato",
            "image": "assets/images/hanasato.jpg",
            "description": "Want to impress your date with fine Asian cuisine? This is the place! ",
            "conditions": [
                "restaurant AND (romantic OR private OR family) AND lang_japanese AND expensive "
            ]
        },        
        {
            "name": "De Pijp Wine & Dine",
            "image": "assets/images/dePijp.jpg",
            "description": "For a romantic evening and great top class food, this is a must not miss! Known as one of the best suprise menu restaurants in Groningen!",
            "conditions": [
                "restaurant AND (business OR leisure) AND (romantic OR private OR family) AND expensive AND lang_french "
            ]
        },   
        {
            "name": "Vive la Vie",
            "image": "assets/images/vivelavie.jpg",
            "description": "The best restaurant in Groningen without a doubt! Celebrating something special? Get your taste buds ready for an unforgettable experience!  ",
            "conditions": [
                "restaurant  AND (business OR leisure) AND (romantic OR private ) AND expensive AND ( lang_dutch OR lang_french)"
            ]
        },     
        {
            "name": "Voila",
            "image": "assets/images/voila.jpg",
            "description": "Bringing the French cuisine to you in Groningen! A 5 course suprise menu accompanied by 5 different glasses of wine, leaving you amazed by the end of the night!  ",
            "conditions": [
                "restaurant  AND (business OR leisure) AND (romantic OR private OR family) AND expensive AND lang_dutch "
            ]
        },
        {
            "name": "Restaurant Nassau",
            "image": "assets/images/nassau.jpg",
            "description": "In the Prinsenhof Hotel! Nassau's kitchen is run by executive chef Christian de Vries. Nassau is innovative and receives praising reviews in the Michelin and Lekker guides.",
            "conditions": [
                "restaurant   AND (leisure OR business) AND (romantic OR cultural) AND expensive AND (lang_dutch OR lang_french) "
            ]
        },
        {
            "name": "Brasserie Groen",
            "image": "assets/images/groen.jpg",
            "description": " A beautiful place in the centre of Groningen. The dishes are prepared with organic and regional products and, of course, lots of love. It's also vegan and vegetarian friendly ",
            "conditions": [
                "restaurant   AND (leisure OR business) AND gang AND average AND lang_dutch "
            ]
        },
        {
            "name": "Boccaccio",
            "image": "assets/images/boccaccio.jpg",
            "description": "A place with Italian food in the city center of Groningen. Be it for a business meeting or for a large group, this is a perfect place. ",
            "conditions": [
                "restaurant   AND (leisure OR business) AND (gang OR private) AND average AND lang_italian "
            ]
        },
        {
            "name": "Konbu Streetfood",
            "image": "assets/images/konbu.jpg",
            "description": "Affordable bites for all, that will keep you going back for more! ",
            "conditions": [
                "restaurant   AND romantic AND (cheap OR average) AND lang_vietnamese "
            ]
        },
        {
            "name": "'t Pannekoekschip'",
            "image": "assets/images/pannekoekschip.jpg",
            "description": "Definitely a must go if you want to experience the Dutch culture, aside from being a restaurant on the water it serves pancake dishes! yumm ",
            "conditions": [
                "restaurant AND (business OR leisure) AND (family OR cultural OR gang ) AND (cheap OR average) AND lang_dutch "
            ]
        },
        {
            "name": "Tian Tian Le",
            "image": "assets/images/tiantianle.jpg",
            "description": "Want to feel relaxed and zen? This is a must not miss, especially for the food! ",
            "conditions": [
                "restaurant   AND leisure AND (gang OR family) AND (cheap OR average)  AND ( lang_chinese OR lang_chilean ) "
            ]
        },
        {
            "name": "Chaplin's Pub",
            "image": "assets/images/chaplinsPub.jpg",
            "description": "Just the place for you to grab a beer with the boys!",
            "conditions": [
                "restaurant   AND leisure AND (gang OR bar) AND (cheap OR average) AND lang_us"
            ]
        },
        {
            "name": "Magoya",
            "image":"assets/images/magoya.jpg",
            "description": "Beautiful Sakura decorations and delicious asian dishes, the best place to be aesthetically pleased and gastronomically fulfilled",
            "conditions": [
                "restaurant   AND (gang OR romantic OR family) AND (cheap OR average) AND lang_japanese "
            ]
        },
        {
            "name": "Houdt van Eten",
            "image":"assets/images/houdtVanEten.jpg",
            "description": "Delicious French cuisine in a beautiful place in the heart of Groningen",
            "conditions": [
                "restaurant   AND (leisure OR business) AND (private OR romantic OR gang) AND average AND lang_french "
            ]
        },
        {
            "name": "De Pasta Fabriek",
            "image":"assets/images/pastaFabriek.jpg",
            "description": "Angel's favorite Diavolo Pasta! A help yourself restaurant with a chill vibe!",
            "conditions": [
                "restaurant   AND (business OR leisure) AND (gang OR family) AND cheap  AND lang_italian "
            ]
        },
        {
            "name": "Vapiano",
            "image":"assets/images/vapiano.jpg",
            "description": " It seems like Vapiano is the best place for you, here you'll find an excellent meal for a low price. On top of that, it's vegan/vegetarian friendly ;)  ",
            "conditions": [
                "restaurant   AND (business OR leisure) AND gang AND cheap AND lang_italian "
            ]
        },
        {
            "name": "Asia Today",
            "image":"assets/images/asiaToday.jpg",
            "description": " This place is perfect for business or leisure, with the opportunity to try dishes from a variety of different asian cultures.   ",
            "conditions": [
                "restaurant   AND (business OR leisure) AND (gang OR cultural OR private) AND cheap AND (lang_chinese OR lang_thai OR lang_japanese)"
            ]
        },
        {
            "name": "Starbucks",
            "image":"assets/images/strabucksUB.jpg",
            "description": "In need for a study place while combining it with a chat with your friend? Here you go, the best coffee right in the building of the University library, what else can one wish for? (p.s. also good for business)",
            "conditions": [
                "cafe  AND  studying  AND average  AND (coffee OR smoothies OR hot_chocolate) AND NOT (private AND hot_chocolate) "
            ]
        },
        {
            "name": "De Uurwerker",
            "image":"assets/images/deUurwerker.jpg",
            "description": "Located in the neighbourhood of the university, this place offers a cozy atmosphere for you and your friends or colleagues. It also has a very nice courtyard for the warmer days ;)",
            "conditions": [
                "cafe AND (leisure OR (business AND (bar OR private OR gang))) AND (average OR cheap)  AND (bar OR private) AND coffee"
            ]
        },
        {
            "name": "Doppio Espresso",
            "image":"assets/images/doppioEspresso.jpg",
            "description": "This is the place to be if you'd like to have a cup of refreshing coffee with your friends.",
            "conditions": [
                "cafe AND leisure AND gang AND (cheap OR average) AND coffee "
            ]
        },
        {
            "name": "Coffee Company",
            "image":"assets/images/coffeeCompany.jpg",
            "description": "This is the perfect place to serve a coffee in a relaxed and cozy atmosphere, be it for studying, going out with your friends or family.",
            "conditions": [
                "cafe   AND ((leisure AND (gang OR family)) OR studying)  AND (cheap OR average) AND coffee"
            ]
        },
        {
            "name": "Black & Bloom",
            "image":"assets/images/blackBloom.jpg",
            "description": "Experiment with white and black coffee at Black & Bloom, once here you'll want to come back again ",
            "conditions": [
                 "cafe  AND leisure AND (cheap OR average) AND coffee " 
             ]
        },
        {
            "name": "Chocolate Company",
            "image": "assets/images/chocoCompany.jpg",
            "description": "Your sweet tooth thirves for some chocolate? This is where you want to be ;)",
            "conditions": [
                "cafe AND (leisure OR studying) AND (gang OR private) AND (cheap OR average) AND hot_chocolate"
            ]
        },
        {
            "name": "Smooth Brothers",
            "image":"assets/images/smoothBrothers.jpg",
            "description": "The perfect place if you feel in a jazzy mood and want to delight yourself with a smoothy among other ",
            "conditions": [
                "cafe AND leisure AND average AND (private OR bar OR gang) AND smoothies" 
            ]
        },
        {
            "name": "Cappuvino",
            "image":"assets/images/cappuvino.jpg",
            "description": "A special place with coffee, wine and jazz in the heart of Groningen",
            "conditions": [
                 "cafe AND (leisure OR business) AND average AND (coffee OR hot_chocolate) AND NOT family"
             ]
        },
        {
            "name": "Pure",
            "image":"assets/images/pure.jpg",
            "description": "A wide range of ice-cream flavours and donuts for your kind and the best coffee for you, all of it at the best price!",
            "conditions": [
                 "cafe AND leisure AND cheap AND  (coffee OR hot_chocolate) AND family"
             ]
        },
        {
            "name": "Tucano",
            "image":"assets/images/tucano.jpg",
            "description": "Cozy atmosphere, perfect for studying, business or a just having a good time ;)",
            "conditions": [
                 "cafe AND (leisure OR business OR studying) AND (average OR cheap )  AND (coffee OR hot_chocolate OR smoothies) AND NOT (coffee AND studying) AND NOT (hot_chocolate AND studying) "
             ]
        }        
    ],
    "questions": [
        {
            "name": "What are you looking for?",
            "description": "",
            "maxAnswers": 1,
            "conditions": [ ],
            "options": [
                {
                    "description": "Cafes",
                    "events": [ "cafe = 1" ]
                },
                {
                    "description": "Restaurants/ Bars and Pubs",
                    "events": [ "restaurant = 1" ]
                },
                {
                    "description": "Hotels",
                    "events": [ "hotel = 1" ]
                }
            ]
        },
        {
            "name": "What is your main goal?",
            "description": "",
            "maxAnswers": 1,
            "conditions": [ "hotel OR cafe OR restaurant" ],
            "options": [
                {
                    "description": "Business Meeting",
                    "events": [ "business = 1" ]
                },
                {
                    "description": "Leisure/Tourism",
                    "events": [ "leisure = 1" ]
                },
                {
                    "description": "Studying",
                    "conditions": ["NOT restaurant AND NOT hotel "],
                    "events": [ "studying = 1" ]
                }
            ]
        },
        {
            "name": "How much are you willing to spend?",
            "description": "",
            "maxAnswers": 1,
            "conditions": [ "userHasGoal"],
            "options": [
                {
                    "conditions": [ "restaurant OR hotel" ],
                    "description": "Let the money flow",
                    "events": [ "expensive = 1" ]
                },
                {
                    "description": "Mid-range",
                    "events": [ "average = 1" ]
                },
                {
                    "description": "On a budget",
                    "events": [ "cheap = 1" ]
                }
            ]
        },
        {
            "name": "What do you have in mind?",
            "description": "",
            "maxAnswers": 1,
            "conditions": [ "userStatedBudget" ],
            "options": [
                {
                    "description": "Family and children",
                    "conditions":["NOT business AND NOT studying"],
                    "events": [ "family = 1" ]
                },
                {
                    "description": "Romantic",
                    "conditions":["NOT business AND NOT cafe"],
                    "events": [ "romantic = 1" ]
                },
                {
                    "description": "Cultural experience",
                    "conditions":["NOT cafe "],                    
                    "events": [ "cultural = 1"  ]
                },                
                {
                    "description": "Private",
                    "conditions":["NOT hotel "],
                    "events": [ "private = 1"]
                },
                {
                    "description": "Bar",
                    "conditions":["NOT hotel AND NOT (business AND restaurant) AND NOT studying"],
                    "events": [ "bar = 1" ]
                },
                {
                    "description": "For the whole gang",
                    "conditions":["NOT hotel "],
                    "events": [ "gang = 1"]
                }
            ]
        }, 
        {
            "name": "What service preference do you have?",
            "description": "",
            "maxAnswers": 2,
            "conditions": [ "money AND NOT (cafe OR restaurant) OR ( userHasSocialGoal AND NOT (cafe OR restaurant)) OR (userHasGoal AND hotel)"],
            "options": [              
                {
                    "description": "Long stay (up to a couple of months)",
                    "events": [ "service_long_stay = 1"]
                },
                {
                    "description": "Breakfast included",
                    "events": [ "service_breakfast = 1" ]
                }, 
                {
                    "description": "Conference room",
                    "conditions": ["NOT leisure"],
                    "events": [ "service_meeting_room = 1" ]
                },
                {
                    "description": "Bar scene",                    
                    "events": [ "service_bar = 1" ]
                }
            ]
        }, 
        {
            "name": "What type of cuisine are you looking for?",
            "description": "",
            "maxAnswers": 1,
            "conditions": [ "userHasSocialGoal AND NOT (cafe OR hotel)" ],
            "options": [                
                {
                    "description": "European",
                    "events": [ "region_european = 1" ]
                },
                {
                    "description": "Asian",                    
                    "events": [ "region_asian = 1" ]
                },
                {
                    "description": "American",
                    "conditions": [ "NOT romantic AND NOT private AND NOT cultural" ],
                    "events": [ "region_american = 1" ]
                }
            ]
        },
        {
            "name": "You have chosen American cuisine",
            "description": "please, specify",
            "maxAnswers": 1,
            "conditions": [ "region_american" ],
            "options": [                
                {
                    "description": "US",
                    "events": [ "lang_us = 1" ]
                },
                {
                    "description": "Chilean",
                    "conditions": [ "NOT business" ],
                    "events": [ "lang_chilean = 1" ]
                }
            ]
        },
        {
            "name": "You have chosen European cuisine",
            "description": "please, specify",
            "maxAnswers": 1,
            "conditions": [ "region_european" ],
            "options": [                
                {
                    "description": "Dutch",
                    "events": [ "lang_dutch = 1", "cultural = 1" ]
                },
                {
                    "description": "French",
                    "conditions": ["NOT cheap AND NOT (average AND cultural)"],
                    "events": [ "lang_french = 1" ]
                },
                {
                    "description": "Italian",
                    "conditions": ["NOT expensive AND NOT private"],
                    "events": [ "lang_italian = 1" ]
                },
                {
                    "description": "Greek",
                    "conditions": ["NOT expensive AND gang AND NOT private"],
                    "events": [ "lang_greek = 1" ]
                }
            ]
        },
        {
            "name": "You have chosen Asian cuisine",
            "description": "please, specify",
            "maxAnswers": 1,
            "conditions": [ "region_asian" ],
            "options": [
                {
                    "description": "Thai",
                    "events": [ "lang_thai = 1" ]
                },
                {
                    "description": "Japanese",
                    "conditions":["NOT (business AND (expensive OR average))"],
                    "events": [ "lang_japanese = 1" ]
                },
                {
                    "description": "Chinese",
                    "conditions":[" family AND (cheap OR average)"],
                    "events": [ "lang_chinese = 1" ]
                },
                {
                    "description": "Vietnamese",
                    "conditions":["romantic AND (cheap OR average)"],
                    "events": [ "lang_vietnamese = 1" ]
                }
            ]
        },
        {
            "name": "You chose Cafes",
            "description": "please specify",
            "maxAnswers": 3,
            "conditions": [ "cafe" ],
            "options": [
                {
                    "description": "Hot Chocolate",
                    "events": [ "hot_chocolate = 1" ]
                },
                {
                    "description": "Smoothies",
                    "conditions":["NOT (bar AND business)"],
                    "events": [ "smoothies = 1" ]
                },
                {
                    "description": "Coffee",
                    "events": [ "coffee = 1" ]
                }
            ]
        },
        {
            "name": "What area would you prefer?",
            "description": "",
            "image": null,
            "maxAnswers": 1,
            "conditions": [ "userChoseHotelService AND NOT( cafe OR restaurant) "],
            "options": [
                {
                    "description": "City center",
                    "events": [ "area_citycenter = 1" ]
                },
                {
                    "description": "Korrewegwijk",
                    "conditions":["NOT service_long_stay AND NOT business AND average AND family"],
                    "events": [ "area_korrewegwijk = 1" ]
                },
                {
                    "description": "Rivierenbuurt",
                    "events": [ "area_rivierenbuurt = 1" ]
                }
            ]
        }
    ]
}
